SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    if (!VL53L5CX_IsBaselineReady()) {
        printf("[ERROR] Baseline learning failed!\n");
        while (1) vTaskDelay(pdMS_TO_TICKS(1000));
    }

    printf("\n[MONITORING] Watching zones for insect passage...\n");
#if CAPTURE_MODE == 1
    printf("  Capture Mode: CONTINUOUS (camera always running, fast snap)\n");
#else
    printf("  Capture Mode: ON-DEMAND (full init per capture)\n");
#endif
    printf("  Camera will auto-capture on insect detection.\n\n");

    uint32_t capture_count = 0;
    uint32_t cooldown_frames = 0;
    const uint32_t COOLDOWN_FRAMES_VALUE = 30;

    /* ---- Debug output counters (controlled from here) ---- */
    static uint32_t debug_frame_count = 0;
    static uint32_t allparam_count    = 0;

    while (1) {
        /* ---- Update detection module ---- */
        if (!VL53L5CX_Update()) {
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }

        /* ---- Continuous debug output for Python monitor ---- */
        debug_frame_count++;
        if (debug_frame_count >= 1) {
            debug_frame_count = 0;
            //VL53L5CX_PrintZFrame();
        }

#if VL53L5CX_DET_DEBUG_ALLPARAMS > 0
        allparam_count++;
        if (allparam_count >= VL53L5CX_DET_DEBUG_ALLPARAM_INT) {
            allparam_count = 0;
            //VL53L5CX_PrintAllZoneParams();
        }
#endif

        /* ---- Check cooldown ---- */
        if (cooldown_frames > 0) cooldown_frames--;

        /* ---- Insect detected? ---- */
        if (VL53L5CX_IsInsectDetected() && cooldown_frames == 0) {
            /* Guard: skip if a capture is already in progress */
            if (capture_in_progress) {
                printf("    [SKIP] Capture already in progress, ignoring detection.\n");
                continue;
            }
            capture_in_progress = 1;

            VL53L5CX_DetectionResult_t result = VL53L5CX_GetResult();

            const char *trig_str;
            switch (result.trigger_source) {
                case VL53L5CX_TRIG_SIGNAL: trig_str = "signal"; break;
                case VL53L5CX_TRIG_MOTION: trig_str = "motion"; break;
                case VL53L5CX_TRIG_BOTH:   trig_str = "signal+motion"; break;
                default:                    trig_str = "unknown"; break;
            }

            printf(">>> INSECT DETECTED! Trigger: %s (%u zones)\n",
                   trig_str, result.affected_count);


            /* ---- TRIGGER CAMERA CAPTURE ---- */
            uint32_t t_total_start = HAL_GetTick();
            uint32_t t_cam_start, t_cam_end, t_sd_start, t_sd_end;
            uint32_t frame_size = (uint32_t)SNAP_WIDTH * SNAP_HEIGHT * 2UL;
            const uint8_t *frame_to_save = NULL;

#if CAPTURE_MODE == 1
            /* CONTINUOUS MODE: Snap FIRST (frame already in capture_buf), 
               then illuminate + save. Zero delay before snap! */
            printf("    [CONTINUOUS] Snapping current frame (IMMEDIATE)...\n");
            BSP_LED_Off(LED_GREEN);
            BSP_LED_On(LED_RED);

            /* SNAP FIRST — memcpy the frame that's already sitting in capture_buf */
            t_cam_start = HAL_GetTick();
            int rc = CAM_ContinuousSnap(save_buf, frame_size);
            t_cam_end = HAL_GetTick();

            /* NOW illuminate (after snap, no delay) */
            WS2812_TurnOn();
            WS2812_TurnOff();

            if (rc == 0) {
                frame_to_save = save_buf;
                printf("    [CONTINUOUS] Frame snapped in %lu ms\n", (unsigned long)(t_cam_end - t_cam_start));
            } else {
                printf("    [ERROR] ContinuousSnap failed (rc=%d)!\n", rc);
                BSP_LED_Off(LED_RED);
                BSP_LED_On(LED_GREEN);
                capture_in_progress = 0;
                continue;
            }
#else
            /* ON-DEMAND MODE: Full init + warmup + capture + deinit */
            printf("    [ON-DEMAND] Full camera init + capture...\n");
            BSP_LED_Off(LED_GREEN);
            BSP_LED_On(LED_RED);
            WS2812_TurnOn();
            vTaskDelay(pdMS_TO_TICKS(100));
            WS2812_TurnOff();

            t_cam_start = HAL_GetTick();
            int rc = CAM_CaptureSingleFrame(capture_buf, MAX_SNAP_FRAME_SIZE,
                                            SNAP_WIDTH, SNAP_HEIGHT,
                                            SNAP_FPS, SNAP_WARMUP_FRAMES);
            t_cam_end = HAL_GetTick();

            if (rc == 0) {
                frame_to_save = capture_buf;
                printf("    [ON-DEMAND] Captured in %lu ms\n", (unsigned long)(t_cam_end - t_cam_start));
            } else {
                printf("    [ERROR] Camera capture failed (rc=%d)!\n", rc);
                BSP_LED_Off(LED_RED);
                BSP_LED_On(LED_GREEN);
                capture_in_progress = 0;
                continue;
            }
#endif

            /* ---- SAVE TO SD CARD ---- */
            t_sd_start = HAL_GetTick();
            uint32_t total_blocks = (SD_IMG_HEADER_SIZE + frame_size + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
            uint32_t target_block = snap_base_block + (capture_count * total_blocks);
            uint32_t saved_base = SD_IMG_BASE_BLOCK;
            SD_IMG_BASE_BLOCK = target_block;

            if (SD_StoreRawImage(frame_to_save, frame_size, SNAP_WIDTH, SNAP_HEIGHT, 0) == 0) {
                capture_count++;
                snap_count++;
                t_sd_end = HAL_GetTick();
                printf("    >>> Snapshot #%lu SAVED (block %lu)\n",
                       (unsigned long)capture_count, (unsigned long)target_block);
                printf("    [PERF] Camera=%lums + SD=%lums = Total=%lums\n",
                       (unsigned long)(t_cam_end - t_cam_start),
                       (unsigned long)(t_sd_end - t_sd_start),
                       (unsigned long)(t_sd_end - t_total_start));
            } else {
                t_sd_end = HAL_GetTick();
                printf("    [ERROR] SD write failed! (SD took %lu ms)\n",
                       (unsigned long)(t_sd_end - t_sd_start));
            }

